# SiteMergeDisconnected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..SiteMergeDisconnected Property
BuiltInFailures..::..SiteFailures Class See Also
---
The two surfaces you are trying to merge are disconnected from one another. They should overlap, or at least share edges.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SiteMergeDisconnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SiteMergeDisconnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SiteMergeDisconnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace